Revit 2024 API
IExternalData Interface
 The base interface for data classes used when executing servers of external services.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public interface IExternalData
Visual Basic
Public Interface IExternalData
Visual C++
public interface class IExternalData
Remarks
 Each and every external service defines a concrete class derived from this interface and adds data and methods as it sees fit for executions of such a particular service.
See Also
Autodesk.Revit.DB.ExternalService Namespace